src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архитектура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияИнформацииОСистеме</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнегоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МакАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистемаВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписи</name>
    <comment>Период записи данных в регистр сведений &quot;Текущие значения производительности&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьДоступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеПроизводительности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОС</name>
    <type>
      <types>EnumRef.ТипОС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРоль</name>
    <type>
      <types>CatalogRef.РолиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСчетчикПоНаименованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеЛицензий1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияRing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаUTCОбновленияЛицензий1С</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СобиратьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Зафиксировать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиОборудования</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиРолей</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Оборудование/Forms/ФормаИзменитьЭлементыСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтотОбъект.Параметры.Свойство("СобиратьДанныеПроизводительности") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "СобиратьДанныеПроизводительности";
        НовСтрока.ПредставлениеРеквизита = "Включить сбор счетчиков";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.СобиратьДанныеПроизводительности;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ПериодЗаписи") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ПериодЗаписи";
        НовСтрока.ПредставлениеРеквизита = "Период записи";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ПериодЗаписи;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ПроверятьДоступность") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ПроверятьДоступность";
        НовСтрока.ПредставлениеРеквизита = "Проверять доступность";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ПроверятьДоступность;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("Таймаут") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "Таймаут";
        НовСтрока.ПредставлениеРеквизита = "Таймаут";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.Таймаут;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ПериодКонтроля") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ПериодКонтроля";
        НовСтрока.ПредставлениеРеквизита = "Период контроля";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ПериодКонтроля;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("МинимальныйПроцентДоступности") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "МинимальныйПроцентДоступности";
        НовСтрока.ПредставлениеРеквизита = "Минимальный процент доступности";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.МинимальныйПроцентДоступности;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ДопустимоНетДанных") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ДопустимоНетДанных";
        НовСтрока.ПредставлениеРеквизита = "Допустимо нет данных";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ДопустимоНетДанных;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ИспользоватьВнешнегоАгента") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ИспользоватьВнешнегоАгента";
        НовСтрока.ПредставлениеРеквизита = "Использовать внешнего агента";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ИспользоватьВнешнегоАгента;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("РегистрироватьДампы") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "РегистрироватьДампы";
        НовСтрока.ПредставлениеРеквизита = "Регистрировать дампы";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.РегистрироватьДампы;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
    
    РезультатЗакрытия = Новый Структура;
    
    Для Каждого ТекСтрока Из ЭтотОбъект.РеквизитыИзменить Цикл
        
        Если ТекСтрока.ФлагИзменить Тогда
            РезультатЗакрытия.Вставить(ТекСтрока.ИмяРеквизита, ТекСтрока.ЗначениеРеквизита);
        КонецЕсли;
        
    КонецЦикла;
    
    ЭтотОбъект.Закрыть(РезультатЗакрытия);
    
КонецПроцедуры

#КонецОбласти
